base/Documents/бит_му_ПересчетВВалютуПредставления.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>бит_му_ПересчетВВалютуПредставления</Name>
			<Comment>(БИТ МУ)</Comment>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccountingRegister.бит_Дополнительный_4</xr:Item>
				<xr:Item>AccumulationRegister.бит_ОборотыПоБюджетам</xr:Item>
				<xr:Item>AccountingRegister.бит_Дополнительный_3</xr:Item>
				<xr:Item>AccountingRegister.бит_Дополнительный_1</xr:Item>
				<xr:Item>AccumulationRegister.бит_СоответствиеОборотовТрансляции</xr:Item>
				<xr:Item>AccumulationRegister.бит_ОборотыПоТипамПроводок</xr:Item>
				<xr:Item>AccountingRegister.бит_Бюджетирование</xr:Item>
				<xr:Item>AccountingRegister.бит_Дополнительный_5</xr:Item>
				<xr:Item>AccountingRegister.бит_Дополнительный_2</xr:Item>
				<xr:Item>InformationRegister.бит_СоответствиеЗаписейТрансляции</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РучнаяКорректировка</Name>
					<Comment>Ручная корректировка (служебный реквизит)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтчетнаяДата</Name>
					<Comment>Отчетная дата</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДоходов</Name>
					<Comment>Счет доходов по трансляционным разницам</Comment>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.бит_Дополнительный_2</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СубконтоДоходов1</Name>
					<Comment>Аналитика счета доходов 1</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.бит_ВидыСубконтоДополнительные_2</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СубконтоДоходов2</Name>
					<Comment>Аналитика счета доходов 2</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.бит_ВидыСубконтоДополнительные_2</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СубконтоДоходов3</Name>
					<Comment>Аналитика счета доходов 3</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.бит_ВидыСубконтоДополнительные_2</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СубконтоДоходов4</Name>
					<Comment>Аналитика счета доходов 4</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.бит_ВидыСубконтоДополнительные_2</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетРасходов</Name>
					<Comment>Счет расходов по трансляционным разницам</Comment>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.бит_Дополнительный_2</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СубконтоРасходов1</Name>
					<Comment>Аналитика счета расходов 1</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.бит_ВидыСубконтоДополнительные_2</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СубконтоРасходов2</Name>
					<Comment>Аналитика счета расходов 2</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.бит_ВидыСубконтоДополнительные_2</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СубконтоРасходов3</Name>
					<Comment>Аналитика счета расходов 3</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.бит_ВидыСубконтоДополнительные_2</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СубконтоРасходов4</Name>
					<Comment>Аналитика счета расходов 4</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.бит_ВидыСубконтоДополнительные_2</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТрансляционныеРазницы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Счет</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.бит_Дополнительный_2</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Субконто1</Name>
							<Comment>Аналитика счета 1</Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.бит_ВидыСубконтоДополнительные_2</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Субконто2</Name>
							<Comment>Аналитика счета 2</Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.бит_ВидыСубконтоДополнительные_2</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Субконто3</Name>
							<Comment>Аналитика счета 3</Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.бит_ВидыСубконтоДополнительные_2</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Субконто4</Name>
							<Comment>Аналитика счета 4</Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.бит_ВидыСубконтоДополнительные_2</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаМСФО</Name>
							<Comment>Сумма МСФО</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаУпр</Name>
							<Comment>Сумма упр</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаУпрРасчет</Name>
							<Comment>Сумма упр расчет</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Разница</Name>
							<Comment>Разница</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидОстатка</Name>
							<Type>
								<v8:Type>cfg:EnumRef.бит_ДтКт</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

base/Enums/бит_ДтКт.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>бит_ДтКт</Name>
			<Comment>(БИТ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Дт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Кт</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

base/Documents/бит_му_ПересчетВВалютуПредставления/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОписаниеПеременных

Перем мКоличествоСубконтоМУ Экспорт; // Хранит количество субконто международного учета в документе.

#КонецОбласти 

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	// Заполнить реквизиты значениями по умолчанию.
	бит_ОбщегоНазначения.ЗаполнитьШапкуДокумента(ЭтотОбъект, Пользователи.ТекущийПользователь(), Неопределено);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
		
	Если ОбменДанными.Загрузка Тогда
		// В случае выполнения обмена данными не производить проверку.
		Возврат;			
	КонецЕсли; 
		

		
КонецПроцедуры // ПередЗаписью()
	
Процедура ПриЗаписи(Отказ)
		
	Если ОбменДанными.Загрузка Тогда
		// В случае выполнения обмена данными не производить проверку.
		Возврат;			
	КонецЕсли; 
		
	
		
КонецПроцедуры // ПриЗаписи()

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	

	
	// Заголовок для сообщений об ошибках проведения.
	Заголовок = бит_ОбщегоНазначения.ПредставлениеДокументаПриПроведении(Ссылка);
	
	 // Проверка ручной корректировки
	Если бит_ОбщегоНазначения.РучнаяКорректировкаОбработкаПроведения(РучнаяКорректировка,Отказ,Заголовок,ЭтотОбъект,Ложь) Тогда
		Возврат
	КонецЕсли;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли; 
	
	СтруктураШапкиДокумента = бит_ОбщегоНазначения.СформироватьСтруктуруШапкиДокумента(ЭтотОбъект);

	СтруктураТаблиц 		= ПодготовитьТаблицыДокумента(СтруктураШапкиДокумента);	
	
	// Выполним движения
	Если НЕ Отказ Тогда
		ДвиженияПоРегистрам(СтруктураШапкиДокумента,СтруктураТаблиц,Отказ,Заголовок);
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	бит_ОбщегоНазначения.УдалитьДвиженияРегистратора(ЭтотОбъект, Отказ, РучнаяКорректировка);

КонецПроцедуры

#КонецОбласти 

#Область СлужебныеПроцедурыИФункции

// Функция готовит таблицы документа для проведения.
// 
// Параметры:
//  СтруктураШапкиДокумента - Структура.
// 
// Возвращаемое значение:
//  СтруктураТаблиц - Структура.
// 
Функция ПодготовитьТаблицыДокумента(СтруктураШапкиДокумента)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТрансляционныеРазницы.Счет КАК Счет,
	               |	ТрансляционныеРазницы.Субконто1 КАК Субконто1,
	               |	ТрансляционныеРазницы.Субконто2 КАК Субконто2,
	               |	ТрансляционныеРазницы.Субконто3 КАК Субконто3,
	               |	ТрансляционныеРазницы.Субконто4 КАК Субконто4,
	               |	ТрансляционныеРазницы.Разница КАК Разница,
	               |	ТрансляционныеРазницы.ВидОстатка КАК ВидОстатка
	               |ИЗ
	               |	Документ.бит_му_ПересчетВВалютуПредставления.ТрансляционныеРазницы КАК ТрансляционныеРазницы
	               |ГДЕ
	               |	ТрансляционныеРазницы.Ссылка = &Ссылка";
				   
	РезультатЗапроса = Запрос.Выполнить();
	Таблица = РезультатЗапроса.Выгрузить();
	
	СтруктураТаблиц = Новый Структура;
	СтруктураТаблиц.Вставить("ТрансляционныеРазницы", Таблица);
	
	Возврат СтруктураТаблиц;
	
КонецФункции // ПодготовитьТаблицыДокумента()

// Процедура выполняет движения по регистрам.
// 
Процедура ДвиженияПоРегистрам(СтруктураШапкиДокумента,СтруктураТаблиц,Отказ,Заголовок)
	
	Для каждого СтрокаТаблицы Из СтруктураТаблиц.ТрансляционныеРазницы Цикл
		
		Если СтрокаТаблицы.Счет.Вид = ВидСчета.Активный Тогда
		
			СформироватьДвижениеПоРегиструМУ(ВидСчета.Активный, СтрокаТаблицы, СтруктураШапкиДокумента);
		
		ИначеЕсли СтрокаТаблицы.Счет.Вид = ВидСчета.Пассивный Тогда
		
			СформироватьДвижениеПоРегиструМУ(ВидСчета.Пассивный, СтрокаТаблицы, СтруктураШапкиДокумента);	
			
		ИначеЕсли СтрокаТаблицы.Счет.Вид = ВидСчета.АктивноПассивный Тогда
			Если СтрокаТаблицы.ВидОстатка = Перечисления.бит_ДтКт.Дт Тогда
				СформироватьДвижениеПоРегиструМУ(ВидСчета.Активный, СтрокаТаблицы, СтруктураШапкиДокумента);
			Иначе
				СформироватьДвижениеПоРегиструМУ(ВидСчета.Пассивный, СтрокаТаблицы, СтруктураШапкиДокумента);
			КонецЕсли; 
		КонецЕсли; 
	
	КонецЦикла; 
	
КонецПроцедуры // ДвиженияПоРегистрам()

// Процедура формирует движение по регистру международного учета. 
//
// Параметры:
//  ВидСчетаСтроки - ВидСчета.
//  СтрокаТаблицы - СтрокаТаблицыЗначений.
//  СтруктураШапкиДокумента - Структура.
//
Процедура СформироватьДвижениеПоРегиструМУ(ВидСчетаСтроки, СтрокаТаблицы, СтруктураШапкиДокумента)

	Если СтрокаТаблицы.Разница = 0 Тогда
	
		Возврат;
	
	КонецЕсли; 
	
	Запись = Движения.бит_Дополнительный_2.Добавить();
	
	СтруктураПараметров = Новый Структура("Организация, Период, Содержание"
										 , СтруктураШапкиДокумента.Организация
										 , СтруктураШапкиДокумента.Дата
										 , НСтр("ru='Трансляционная разница';en='The translation difference'"));
										 
	Если СтрокаТаблицы.Разница > 0  
		И ВидСчетаСтроки = ВидСчета.Активный Тогда
		
		СтруктураПараметров.Вставить("СчетДТ"	 , СтрокаТаблицы.Счет);
		Для  НомерСубконто = 1 По мКоличествоСубконтоМУ Цикл
			бит_му_ОбщегоНазначения.УстановитьСубконто(СтрокаТаблицы.Счет,Запись.СубконтоДт,НомерСубконто,СтрокаТаблицы["Субконто"+НомерСубконто]);			
		КонецЦикла; 
		
		СтруктураПараметров.Вставить("СчетКт"	 , СтруктураШапкиДокумента.СчетДоходов);
		Для  НомерСубконто = 1 По мКоличествоСубконтоМУ Цикл
			бит_му_ОбщегоНазначения.УстановитьСубконто(СтруктураШапкиДокумента.СчетДоходов,Запись.СубконтоКт,НомерСубконто,СтруктураШапкиДокумента["СубконтоДоходов"+НомерСубконто]);			
		КонецЦикла; 
		
	ИначеЕсли СтрокаТаблицы.Разница < 0  
		И ВидСчетаСтроки = ВидСчета.Активный Тогда
		
		СтруктураПараметров.Вставить("СчетДТ"	 , СтруктураШапкиДокумента.СчетРасходов);
		Для  НомерСубконто = 1 По мКоличествоСубконтоМУ Цикл
			бит_му_ОбщегоНазначения.УстановитьСубконто(СтруктураШапкиДокумента.СчетРасходов,Запись.СубконтоДт,НомерСубконто,СтруктураШапкиДокумента["СубконтоРасходов"+НомерСубконто]);			
		КонецЦикла; 
		
		СтруктураПараметров.Вставить("СчетКт"	 , СтрокаТаблицы.Счет);
		Для  НомерСубконто = 1 По мКоличествоСубконтоМУ Цикл
			бит_му_ОбщегоНазначения.УстановитьСубконто(СтрокаТаблицы.Счет,Запись.СубконтоКт,НомерСубконто,СтрокаТаблицы["Субконто"+НомерСубконто]);			
		КонецЦикла; 
		
	ИначеЕсли СтрокаТаблицы.Разница > 0  
		И ВидСчетаСтроки = ВидСчета.Пассивный Тогда
		
		СтруктураПараметров.Вставить("СчетДТ"	 , СтруктураШапкиДокумента.СчетРасходов);
		Для  НомерСубконто = 1 По мКоличествоСубконтоМУ Цикл
			бит_му_ОбщегоНазначения.УстановитьСубконто(СтруктураШапкиДокумента.СчетРасходов,Запись.СубконтоДт,НомерСубконто,СтруктураШапкиДокумента["СубконтоРасходов"+НомерСубконто]);			
		КонецЦикла; 
		
		СтруктураПараметров.Вставить("СчетКт"	 , СтрокаТаблицы.Счет);
		Для  НомерСубконто = 1 По мКоличествоСубконтоМУ Цикл
			бит_му_ОбщегоНазначения.УстановитьСубконто(СтрокаТаблицы.Счет,Запись.СубконтоКт,НомерСубконто,СтрокаТаблицы["Субконто"+НомерСубконто]);			
		КонецЦикла; 
		
	ИначеЕсли СтрокаТаблицы.Разница < 0  
		И ВидСчетаСтроки = ВидСчета.Пассивный Тогда
		
		СтруктураПараметров.Вставить("СчетДТ"	 , СтрокаТаблицы.Счет);
		Для  НомерСубконто = 1 По мКоличествоСубконтоМУ Цикл
			бит_му_ОбщегоНазначения.УстановитьСубконто(СтрокаТаблицы.Счет,Запись.СубконтоДт,НомерСубконто,СтрокаТаблицы["Субконто"+НомерСубконто]);			
		КонецЦикла; 
		
		СтруктураПараметров.Вставить("СчетКт"	 , СтруктураШапкиДокумента.СчетДоходов);
		Для  НомерСубконто = 1 По мКоличествоСубконтоМУ Цикл
			бит_му_ОбщегоНазначения.УстановитьСубконто(СтруктураШапкиДокумента.СчетДоходов,Запись.СубконтоКт,НомерСубконто,СтруктураШапкиДокумента["СубконтоДоходов"+НомерСубконто]);			
		КонецЦикла; 
		
	КонецЕсли; 									 
	
	Запись.Период = ОтчетнаяДата;
	
	// Записываем только сумму упр
	Запись.СуммаУпр = ?(СтрокаТаблицы.Разница<0, -СтрокаТаблицы.Разница, СтрокаТаблицы.Разница);
	
	бит_му_ОбщегоНазначения.ЗаполнитьЗаписьРегистраМУ(Запись, СтруктураПараметров);

КонецПроцедуры // СформироватьДвижениеПоРегиструМУ()

#КонецОбласти 

#Область Инициализация

мКоличествоСубконтоМУ = 4;

#КонецОбласти 

#Иначе
  ВызватьИсключение НСтр("ru='Недопустимый вызов объекта на клиенте.';en='Invalid object call on client'");
#КонецЕсли
